sample soap req & res/CircleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sh="http://example.com/shapetool">

    <soapenv:Header/>

    <soapenv:Body>
        <sh:circleAreaRequest>
            <sh:radius>5</sh:radius>
        </sh:circleAreaRequest>
    </soapenv:Body>

</soapenv:Envelope>